### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.dynamic-subnets-test.azurerm_resource_group.core_network_rg[0] will be created
+   resource "azurerm_resource_group" "core_network_rg" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = "TF-Module-Automated-Tests-Dyn-Subnets"
+       tags     = {
+           "Description" = "This is a demo built with Terraform"
+           "Purpose"     = "Terraform-Core-Networking-Development"
+           "Terraform"   = "True"
        }
    }

  # module.dynamic-subnets-test.azurerm_subnet.dynamic["Dev.10.2.2.0/24"] will be created
+   resource "azurerm_subnet" "dynamic" {
+       address_prefixes                               = [
+           "10.2.2.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "Dev"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "TF-Module-Automated-Tests-Dyn-Subnets"
+       virtual_network_name                           = "TF-VNET-TEST"
    }

  # module.dynamic-subnets-test.azurerm_subnet.dynamic["Dmz1.10.2.0.0/25"] will be created
+   resource "azurerm_subnet" "dynamic" {
+       address_prefixes                               = [
+           "10.2.0.0/25",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "Dmz1"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "TF-Module-Automated-Tests-Dyn-Subnets"
+       virtual_network_name                           = "TF-VNET-TEST"
    }

  # module.dynamic-subnets-test.azurerm_subnet.dynamic["Dmz2.10.2.0.128/25"] will be created
+   resource "azurerm_subnet" "dynamic" {
+       address_prefixes                               = [
+           "10.2.0.128/25",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "Dmz2"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "TF-Module-Automated-Tests-Dyn-Subnets"
+       virtual_network_name                           = "TF-VNET-TEST"
    }

  # module.dynamic-subnets-test.azurerm_subnet.dynamic["Prod.10.2.1.0/24"] will be created
+   resource "azurerm_subnet" "dynamic" {
+       address_prefixes                               = [
+           "10.2.1.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "Prod"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "TF-Module-Automated-Tests-Dyn-Subnets"
+       virtual_network_name                           = "TF-VNET-TEST"
    }

  # module.dynamic-subnets-test.azurerm_virtual_network.core_vnet[0] will be created
+   resource "azurerm_virtual_network" "core_vnet" {
+       address_space       = [
+           "10.2.0.0/22",
        ]
+       dns_servers         = []
+       guid                = (known after apply)
+       id                  = (known after apply)
+       location            = "uksouth"
+       name                = "TF-VNET-TEST"
+       resource_group_name = "TF-Module-Automated-Tests-Dyn-Subnets"
+       subnet              = (known after apply)
+       tags                = {
+           "Description" = "This is a demo built with Terraform"
+           "Purpose"     = "Terraform-Core-Vnet-Development"
+           "Terraform"   = "True"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>